Repository: Bprathmesh/envfriendly
Catalog: lib/l10n/app_*.arb
Languages: kn

# appTitle
source: Smart Refills
kn: ಸ್ಮಾರ್ಟ್ ರೀಫಿಲ್ಸ್

source: Name
kn: ಹೆಸರು

# adminPassword
source: Admin Password (optional)
kn: ನಿರ್ವಾಹಕ ಪಾಸ್‌ವರ್ಡ್ (ಐಚ್ಛಿಕ)

source: Create Account
kn: ಖಾತೆ ಸೃಷ್ಟಿಸಿ

# alreadyHaveAccount
source: Already have an account?
kn: ಈಗಾಗಲೇ ಖಾತೆ ಇದೆಯೇ?

source: Notifications
kn: ಅಧಿಸೂಚನೆಗಳು

source: Profile
kn: ಪ್ರೊಫೈಲ್

source: Select Product
kn: ಉತ್ಪನ್ನವನ್ನು ಆಯ್ಕೆಮಾಡಿ

source: Search Products
kn: ಉತ್ಪನ್ನಗಳನ್ನು ಹುಡುಕಿ

# orderPlaced
source: Order Placed Successfully!
kn: ಆದೇಶವನ್ನು ಯಶಸ್ವಿಯಾಗಿ ನೀಡಲಾಗಿದೆ!

# proceedToKiosk
source: Please proceed to the kiosk to collect your order.
kn: ದಯವಿಟ್ಟು ನಿಮ್ಮ ಆದೇಶವನ್ನು ಸಂಗ್ರಹಿಸಲು ಕಿಯೋಸ್ಕ್‌ಗೆ ಮುಂದುವರಿಯಿರಿ.

source: Login
kn: ಲಾಗಿನ್

source: Email
kn: ಇಮೇಲ್

source: Password
kn: ಪಾಸ್‌ವರ್ಡ್

source: Sign Up
kn: ಸೈನ್ ಅಪ್

source: Welcome Back!
kn: ಮರಳಿ ಸ್ವಾಗತ!

# pleaseLogIn
source: Please log in to continue
kn: ಮುಂದುವರಿಯಲು ದಯವಿಟ್ಟು ಲಾಗ್ ಇನ್ ಮಾಡಿ

# errorOccurred
source: An error occurred. Please try again.
kn: ದೋಷ ಸಂಭವಿಸಿದೆ. ದಯವಿಟ್ಟು ಮತ್ತೆ ಪ್ರಯತ್ನಿಸಿ.

# invalidCredentials
source: Invalid email or password.
kn: ಅಮಾನ್ಯ ಇಮೇಲ್ ಅಥವಾ ಪಾಸ್‌ವರ್ಡ್.

source: Settings
kn: ಸೆಟ್ಟಿಂಗ್‌ಗಳು

source: Dark Mode
kn: ಡಾರ್ಕ್ ಮೋಡ್

source: Language
kn: ಭಾಷೆ

source: Close
kn: ಮುಚ್ಚಿರಿ

source: Search for Kiosk
kn: ಕಿಯೋಸ್ಕ್ ಹುಡುಕಿ

source: Help
kn: ಸಹಾಯ

source: Order History
kn: ಆದೇಶ ಇತಿಹಾಸ

source: Admin Panel
kn: ನಿರ್ವಾಹಕ ಪ್ಯಾನೆಲ್

# becomeAdmin
source: Become an Admin
kn: ನಿರ್ವಾಹಕರಾಗಿ

source: Logout
kn: ಲಾಗ್ ಔಟ್

# dontHaveAccount
source: Dont have an account?
kn: ಖಾತೆ ಇಲ್ಲವೇ?

# welcome
source: Welcome, {name}!
kn: ಸ್ವಾಗತ, {name}!

# selectRefillAmount
source: Select Refill Amount for {product}
kn: {product}ಗಾಗಿ ಮರುಪೂರಣ ಪ್ರಮಾಣವನ್ನು ಆಯ್ಕೆಮಾಡಿ

# errorPlacingOrder
source: Error placing order: {error}
kn: ಆದೇಶ ನೀಡುವಲ್ಲಿ ದೋಷ: {error}

# youAreNowAdmin
source: You are now an admin
kn: ನೀವು ಈಗ ನಿರ್ವಾಹಕರಾಗಿದ್ದೀರಿ

source: Help Center
kn: ಸಹಾಯ ಕೇಂದ್ರ

source: Frequently Asked Questions
kn: ಪದೇ ಪದೇ ಕೇಳಲಾಗುವ ಪ್ರಶ್ನೆಗಳು

# howToFindKiosk
source: How do I find a kiosk?
kn: ನಾನು ಕಿಯೋಸ್ಕ್ ಅನ್ನು ಹೇಗೆ ಕಂಡುಹಿಡಿಯಬಹುದು?

# findKioskAnswer
source: You can find a kiosk by clicking on the "Search for Kiosk" button on the home page. This will show you a list of nearby kiosks.
kn: ಮುಖಪುಟದಲ್ಲಿರುವ "ಕಿಯೋಸ್ಕ್ ಹುಡುಕಿ" ಬಟನ್ ಅನ್ನು ಕ್ಲಿಕ್ ಮಾಡುವ ಮೂಲಕ ನೀವು ಕಿಯೋಸ್ಕ್ ಅನ್ನು ಕಂಡುಹಿಡಿಯಬಹುದು. ಇದು ನಿಮಗೆ ಹತ್ತಿರದ ಕಿಯೋಸ್ಕ್‌ಗಳ ಪಟ್ಟಿಯನ್ನು ತೋರಿಸುತ್ತದೆ.

# howToPlaceOrder
source: How do I place an order?
kn: ನಾನು ಆದೇಶವನ್ನು ಹೇಗೆ ನೀಡಬಹುದು?

# placeOrderAnswer
source: After selecting a kiosk, you can choose a product and select the amount you want to refill. Follow the on-screen instructions to complete your order.
kn: ಕಿಯೋಸ್ಕ್ ಅನ್ನು ಆಯ್ಕೆ ಮಾಡಿದ ನಂತರ, ನೀವು ಉತ್ಪನ್ನವನ್ನು ಆಯ್ಕೆ ಮಾಡಬಹುದು ಮತ್ತು ನೀವು ಮರುಪೂರಣ ಮಾಡಲು ಬಯಸುವ ಪ್ರಮಾಣವನ್ನು ಆಯ್ಕೆ ಮಾಡಬಹುದು. ನಿಮ್ಮ ಆದೇಶವನ್ನು ಪೂರ್ಣಗೊಳಿಸಲು ಸ್ಕ್ರೀನ್‌ನಲ್ಲಿರುವ ಸೂಚನೆಗಳನ್ನು ಅನುಸರಿಸಿ.

# orderIssueQuestion
source: What if I encounter an issue with my order?
kn: ನನ್ನ ಆದೇಶದಲ್ಲಿ ಸಮಸ್ಯೆ ಎದುರಾದರೆ ಏನು ಮಾಡಬೇಕು?

# orderIssueAnswer
source: If you encounter any issues, please contact our customer support at support@rbuy.com or call us at 1-800-RBUY-HELP.
kn: ನೀವು ಯಾವುದೇ ಸಮಸ್ಯೆಗಳನ್ನು ಎದುರಿಸಿದರೆ, ದಯವಿಟ್ಟು ನಮ್ಮ ಗ್ರಾಹಕ ಬೆಂಬಲವನ್ನು support@rbuy.com ನಲ್ಲಿ ಸಂಪರ್ಕಿಸಿ ಅಥವಾ 1-800-RBUY-HELP ಗೆ ಕರೆ ಮಾಡಿ.

source: Contact Support
kn: ಬೆಂಬಲವನ್ನು ಸಂಪರ್ಕಿಸಿ

source: Contacting support...
kn: ಬೆಂಬಲವನ್ನು ಸಂಪರ್ಕಿಸಲಾಗುತ್ತಿದೆ...
